In [8]:
import numpy as np

In [9]:
import pandas as pd

In [ ]:
a=[1,2,3,4,5]
name=["태조","정종","태조","세종","문종"]
life=[73,62,55,53,58]

In [6]:
vars = {'id' : [1, 2, 3, 4, 5],
        'name' : ['태조', '정종', '태조', '세종', '문종'],
        'life' : [73, 62, 55, 53, 38]
        }

In [10]:
data_king = pd.DataFrame(vars, columns = ['id', 'name', 'life'])

In [12]:
data_king

   id name  life
0   1   태조    73
1   2   정종    62
2   3   태조    55
3   4   세종    53
4   5   문종    38

In [17]:
dataset=pd.read_csv('buy.csv')
dataset

      id  year  buy  age  edu  income   exp    co     ad   prod
0      1  2013    1    5    3   17600  8800   9.3  11.36   5.01
1      2  2013    0    4    2    2500  2300  10.2   0.39    NaN
2      3  2013    0    3    1    6700  5400  30.6   3.83  16.67
3      4  2013    1    2    1    1900  1200  24.4   1.36   3.28
4      5  2013    0    3    1    2500  1900  19.7   2.78   2.15
..   ...   ...  ...  ...  ...     ...   ...   ...    ...    ...
695  696  2015    0    2    3    2000  1000   4.7   0.22   0.72
696  697  2015    0    4    2    6600  5500  12.1   2.32   5.67
697  698  2015    1    3    2    2700  1400   4.6   0.26   0.98
698  699  2015    0    4    1    7700  3200   8.4   2.30   4.17
699  700  2015    0    3    1    4400  3600  14.7   2.99   3.47

[700 rows x 10 columns]

In [28]:
np.corrcoef(dataset['income'], dataset['ad'])

array([[1.        , 0.56583209],
       [0.56583209, 1.        ]])

In [85]:
vars1 = {'id' : [NA, NA, NA, 4, 5],
        'name' : ['태조', NA, '태조', '세종', '문종'],
        'life' : [73, NA, 55, 53, 38]
        }

In [86]:
data_king1 = pd.DataFrame(vars1, columns = ['id', 'name', 'life'])

In [87]:
data_king1

    id name  life
0  NaN   태조  73.0
1  NaN  NaN   NaN
2  NaN   태조  55.0
3  4.0   세종  53.0
4  5.0   문종  38.0

In [76]:
data_king1.dropna()

    id name  life
3  4.0   세종    53
4  5.0   문종    38

In [68]:
data_king1['id'].fillna(data_king1['id'].mean())

0    4.5
1    4.5
2    4.5
3    4.0
4    5.0
Name: id, dtype: float64

In [70]:
from numpy import nan as NA

In [88]:
data_king1.dropna(thresh = 1)

    id name  life
0  NaN   태조  73.0
2  NaN   태조  55.0
3  4.0   세종  53.0
4  5.0   문종  38.0

In [ ]:
import numpy as np

In [ ]:
import pandas as pd

In [89]:
dataset=pd.read_csv('buy.csv')
dataset

      id  year  buy  age  edu  income   exp    co     ad   prod
0      1  2013    1    5    3   17600  8800   9.3  11.36   5.01
1      2  2013    0    4    2    2500  2300  10.2   0.39    NaN
2      3  2013    0    3    1    6700  5400  30.6   3.83  16.67
3      4  2013    1    2    1    1900  1200  24.4   1.36   3.28
4      5  2013    0    3    1    2500  1900  19.7   2.78   2.15
..   ...   ...  ...  ...  ...     ...   ...   ...    ...    ...
695  696  2015    0    2    3    2000  1000   4.7   0.22   0.72
696  697  2015    0    4    2    6600  5500  12.1   2.32   5.67
697  698  2015    1    3    2    2700  1400   4.6   0.26   0.98
698  699  2015    0    4    1    7700  3200   8.4   2.30   4.17
699  700  2015    0    3    1    4400  3600  14.7   2.99   3.47

[700 rows x 10 columns]

In [120]:
l=(dataset.year==2013)&(dataset.buy==1) | (dataset.year==2014)&(dataset.buy==1)

0       True
1      False
2      False
3       True
4      False
       ...
695    False
696    False
697    False
698    False
699    False
Length: 700, dtype: bool

In [121]:
dataset.loc[l,['year','age','edu','income','exp']]

     year  age  edu  income   exp
0    2013    5    3   17600  8800
3    2013    2    1    1900  1200
6    2013    3    2    4100  4100
16   2013    2    2    3100  2600
23   2013    2    2    3600  2000
..    ...  ...  ...     ...   ...
463  2014    2    1    2100  1400
464  2014    3    1    4100  3600
468  2014    2    3    2000  2000
475  2014    2    1    1400  1200
477  2014    3    1    3300  2600

[125 rows x 5 columns]

In [122]:
dataset=pd.read_csv('buy.csv')
dataset

      id  year  buy  age  edu  income   exp    co     ad   prod
0      1  2013    1    5    3   17600  8800   9.3  11.36   5.01
1      2  2013    0    4    2    2500  2300  10.2   0.39    NaN
2      3  2013    0    3    1    6700  5400  30.6   3.83  16.67
3      4  2013    1    2    1    1900  1200  24.4   1.36   3.28
4      5  2013    0    3    1    2500  1900  19.7   2.78   2.15
..   ...   ...  ...  ...  ...     ...   ...   ...    ...    ...
695  696  2015    0    2    3    2000  1000   4.7   0.22   0.72
696  697  2015    0    4    2    6600  5500  12.1   2.32   5.67
697  698  2015    1    3    2    2700  1400   4.6   0.26   0.98
698  699  2015    0    4    1    7700  3200   8.4   2.30   4.17
699  700  2015    0    3    1    4400  3600  14.7   2.99   3.47

[700 rows x 10 columns]

In [ ]:
k=(dataset.year==2015)